import os, os.path
import time as t
IFM_PATH='./CtmBook/'
# 전역 변수 -------------------------------------------------
menuCost_1 = {'11':'5000', '12':'4500'}
menuCost_2 = {'21':'3000', '22':'3500'}
n=0
## --------------------------------------------------------
# 함수 정의 -------------------------------------------------
# 메뉴_1 출력 함수----------------------------------------------
# 함 수 명 :  menu_1
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_1():
    print("="*7+'머먹조카페에 어서오세요!'+'='*7)
    print(" "*7+'1. 매    장')
    print(" "*7+'2. 테이크아웃')
    print(" "*7+'3. 종    료')
    print('=' * 26)
# 메뉴_2 출력 함수----------------------------------------------
# 함 수 명 :  menu_2
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_2():
    print("="*7+'어떻게 하시겠어요?'+'='*7)
    print(" "*7+'1. 추천메뉴')
    print(" "*7+'2. 직접선택')
    print(" "*7+'3. 이전화면')
    print('=' * 26)
# 메뉴_2_1 출력 함수----------------------------------------------
# 함 수 명 :  menu_2_1
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_2_1():
    print("="*7+'추천메뉴를 선택해주세요.'+'='*7)
    print(" "*7+'11. 아메리카노+치즈케이크')
    print(" "*7+'12. 아메리카노+타르트')
    print(" "*7+'3. 주문완료')
    print(" "*7+'4. 이전화면')
    print('=' * 26)
# 메뉴_2_2 출력 함수----------------------------------------------
# 함 수 명 :  menu_2_2
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_2_2():
    print("="*7+'메뉴를 선택해주세요.'+'='*7)
    print(" "*7+'21. 아메리카노   3000원')
    print(" "*7+'22. 카페라떼     3500원')
    print(" "*7+'3. 주문완료')
    print(" "*7+'4. 이전화면')
    print('=' * 26)
# 결제 출력 함수----------------------------------------------
# 함 수 명 :  menu_31
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_3():
    print("="*7+'결제방식을 선택해주세요.'+'='*7)
    print(" "*7+'21. 아메리카노   3000원')
    print(" "*7+'22. 카페라떼     3500원')
    print(" "*7+'3. 이전화면')
    print('=' * 26)
# 프로그램 초기화 함수 ------------------------------------------
# CtmBook 폴더 생성 파일 리스트 정보가 추가
# 함 수 명 : initApp
# 파라미터 : 없음
# 반 환 값 : 없음
# ------------------------------------------------------------
def initApp():
    if not os.path.exists(IFM_PATH): os.mkdir(IFM_PATH)
# ------------------------------------------------------------
# 주문 파일_1 생성 및 추가 함수---------------------------------------
# 함 수 명 : addCost_1
# 파라미터 : 가격
# 반환값 : 없음
# ------------------------------------------------------------
def addCost_1(**kwargs):
    filename = ',' + t.strftime('%Y-%m-%d %A %I:%M:%S') + '.txt'
    # 파일명 리스트 추가
    # CtmBook 폴더에 파일 생성
    with open(IFM_PATH+filename, mode='w', encoding='utf-8') as f:
        f.write(menuCost_1[n] + ' ')
# ------------------------------------------------------------
# 주문 파일_2 생성 및 추가 함수---------------------------------------
# 함 수 명 : addCost_2
# 파라미터 : 가격
# 반환값 : 없음
# ------------------------------------------------------------
def addCost_2(**kwargs):
    filename = ',' + t.strftime('%Y-%m-%d %A %I:%M:%S') + '.txt'
    # 파일명 리스트 추가
    # CtmBook 폴더에 파일 생성
    with open(IFM_PATH+filename, mode='w', encoding='utf-8') as f:
        f.write(menuCost_2[n] + ' ')
# ------------------------------------------------------------
# 첫번째 창 함수-------------------------------------------------
# 함 수 명 : select_1
# 파라미터 : n
# 반환값 : 없음
# ---------------------------------------------------------
def select_1(n):
    while True:
        menu_1()
        select = input("어디서 드실건가요?: ")
        if select == '3': break
        elif select == '1':
            select_2(n)
        elif select == '2':
            select_2(n)
        else:
            print('<<<잘못 입력하셨어요.>>>')
    print('프로그램을 종료합니다.')
# 두번째 창 함수------------------------------------
# 함 수 명 : select_2
# 파라미터 : n
# 반환값 : 없음
# ---------------------------------------------------------
def select_2(n):
    while True:
        menu_2()
        select = input("어떻게 하시겠어요?: ")
        if select == '3': break
        elif select == '1':
            select_2_1(n)
        elif select == '2':
            select_2_2(n)
        else:
            print('<<<잘못 입력하셨어요.>>>')
# 2-1째 창 함수------------------------------------
# 함 수 명 : select_2_1
# 파라미터 : n
# 반환값 : 없음
# ---------------------------------------------------------
def select_2_1(n):
    while True:
        menu_2_1()
        select = input("추천메뉴를 선택해주세요.: ")
        if select == '4': break
        elif select == '11':
            addCost_1(n)
        elif select == '12':
            addCost_1(n)
        elif select == '3':
            quit()
        else:
            print('<<<잘못 입력하셨어요.>>>')
# 2-2째 창 함수------------------------------------
# 함 수 명 : select_2_2
# 파라미터 : n
# 반환값 : 없음
# ---------------------------------------------------------
def select_2_2(n):
    while True:
        menu_2_2()
        select = input("메뉴를 선택해주세요.: ")
        if select == '4': break
        elif select == '21':
            addCost_2(n)
        elif select == '22':
            addCost_2(n)
        elif select == '3':
            quit()
        else:
            print('<<<잘못 입력하셨어요.>>>')
# 기능 구현 ----------------------------------------------------
initApp()
select_1(n)