import os, os.path
IFM_PATH='./CtmBook/'
# 함수 정의 -------------------------------------------------
# 메뉴_1 출력 함수----------------------------------------------
# 함 수 명 :  menu_1
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_1():
    print("="*7+'머먹조카페에 어서오세요!'+'='*7)
    print(" "*7+'1. 매    장')
    print(" "*7+'2. 테이크아웃')
    print(" "*7+'3. 종    료')
    print('=' * 26)
# 메뉴_2 출력 함수----------------------------------------------
# 함 수 명 :  menu_2
# 파라미터 : 없음
# 리 턴 값 : 없음
# ----------------------------------------------------------
def menu_2():
    print("="*7+'어떻게 하시겠어요?'+'='*7)
    print(" "*7+'1. 추천메뉴')
    print(" "*7+'2. 직접선택')
    print(" "*7+'3. 이전화면')
    print('=' * 26)
# 첫번째 창 함수------------------------------------
# 함 수 명 : select_1
# 파라미터 : 없음
# 반환값 : 없음
# ---------------------------------------------------------
def select_1():
    while True:
        menu_1()
        select = input("어디서 드실건가요?: ")
        if select == '3': break
        elif select == '1':
            select_2()
        elif select == '2':
            select_2()
        else:
            print('잘못 입력하셨어요.')
    print('프로그램 종료합니다.')
# 두번째 창 함수------------------------------------
# 함 수 명 : select_2
# 파라미터 : 없음
# 반환값 : 없음
# ---------------------------------------------------------
def select_2():
    while True:
        menu_2()
        select = input("어디서 드실건가요?: ")
        if select == '3': break
        elif select == '1':
            pass
        elif select == '2':
            pass
        else:
            print('잘못 입력하셨어요.')
    print('프로그램 종료합니다.')
# 기능 구현 ----------------------------------------------------
# select_1() 구현 ----------------------------------------------------
select_1()